Revit 2027 API
TableCellStyleOverrideOptions.Italics Property
 Indicates if the italics characteristic is overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Italics { get; set; }
Public Property Italics As Boolean
	Get
	Set
public:
property bool Italics {
	bool get ();
	void set (bool value);
}
member Italics : bool with get, set
Property Value
Boolean
See Also
Reference
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace